// Составьте программу, которая выводит на экран все однозначные 
// положительные числа в возрастающем порядке. 
//  Перед началом вывода на экран следует вывести "старт",
//  а после окончания вывода чисел – "финиш".
//  вывод: старт, 1, … 9, финиш)


// alert("Start");
// for(let index=1; index<10; index++){
//     console.log(index);
// }
// alert("Finish");


//  Составьте программу, которая выводит на экран все двузначные положительные числа,
//  делящиеся без остатка на 3 и на 5 
//  (начиная с наименьшего).


// for(let i = 10; i < 100; i++){
//     if (i % 3 == 0 && i % 5 == 0) {
//         console.log(i);
//     }
// }



// Написать цикл, который выводит те числа из массива, которые больше или равны 15.


// let array1 = [-1, 34, 0, 5, 29, 197, -54, 63, 12, -2, 34, 9, 289, 39, 328, 15];
// for(let i = 0; i < array1.length; i ++){
// if (array1[i] >= 15){
//     console.log(array1[i]);
// }}



// Написать цикл, который выводит только нечетные числа массива


// let array2 = [-1, 34, 0, 5, 29, 197, -54, 63, 12, -2, 34, 9, 289, 39, 328, 15];
// for(let i = 0; i < array2.length; i ++){
//     if (array2[i] % 2 !== 0){
//         console.log(array2[i]);
//     }}



// Вывести только те значения массива, индекс которых кратен трем

// let array3 = [-1, 34, 0, 5, 29, 197, -54, 63, 12, -2, 34, 9, 289, 39, 328, 15];
// for(let i = 0; i < array3.length; i ++){
//     if (i % 3 == 0){
//         console.log(array3[i]);  
//     }}
   